---
layout: post
title:  "做好一个产品需要多久"
date:   2017-02-20 19:19:00
categories: Cloudinsight
tags: cloudinsight, product
image: /images/team-gallery.jpg
---

不知不觉我在目前的公司也快 3 年多了，也是一直从事目前的产品工作。尽管中途有接手其他工作，或者发生过诸多意外，但是也算是断断续续地坚持培育这样一个产品。一直以来，我都是很厌恶自己做的东西，倒不是过分谦虚，而是一种天然的恶心感。就像在电视中看到自己被监控拍到的录像，或者听到自己的录音。

从生理来解释这个事情，是因为我们听到自己的声音，是通过骨骼来传递的；我们看到自己的样子，是投过镜子和视网膜反馈给大脑并经由美化的样子。而这种信息和记忆的不匹配导致了大脑的抵触情绪。同样的，我讨厌自己的产品，大概也是因为在规划产品功能时，所实现出来的效果往往不是自己所想象的吧。

只有在最近我才慢慢觉得我做的产品在慢慢变好了。

在这里以我的资历也不够来定义什么是好，以及对时间的解读。我就分享我做这个产品中途发生的关键事情。

## 一次重大失败

刚在做这个产品前，其实经过一次产品研发上的重大失败，直接导致了产品没有研发成功而宣告破产。对外发放的声音也被收回了。就连立项的企业级项目在后期也是由其他产品线的负责完成。

后来总结原因就是一些功能的构想过于理想化，而底层的核心技术又不能够做到如此灵活的功能设计。

就像静态的数据展现和动态的数据展现，从采集方式到上传至存储，再到前端读取，都是不一样的。

![](/images/apm_v0.1.png)

当时除了自责之外，为了逃避责任也在内心将更多的责任归为研发的实力问题上。

现在想想，在设计师、后端研发、产品总监、售前之间没有建立好一个充分沟通的渠道是导致产品直接失败的原因吧。功能的边界在哪，当时在所有人心中都没有达成共识。

## 学习

后来在很长的时间内，我都在做一些纯前端的产品工作，也慢慢了解到如何打通前端和设计之间的隔阂。认识到通用的数据类产品的前端解决方案，技术上如何实现 UI 统一。

那是很长的一段时间。除了实践一些很小很琐碎的事情外，也在不停地观摩国外的 SaaS 产品，甚至在科技媒体里知道了商业模式这些与我无关的事情。也自顾自地认为社交、工具和商业是三种产品分科。

当时是拒绝在做一个完整的产品，去负责从组建团队到最后第一个版本上线，直至进入发展阶段的事情。会害怕再次面对第一次的失败。

![](/images/blueware_website.jpg)

更重要的是在做纯前端产品的这段期间，负责沟通的工作落在了设计师身上，并不在我。害怕被拒绝，害怕被一而再再而三的拒绝，这种内向的性格一直在拖着我不能往前走。

在逐步完成了官网、SEM 等等事情后，我也变成了一个颇为清闲的产品经理。
